[
  { "text": "Cut your losses early; the market rarely apologizes." },
  { "text": "Let winners run, but never let hope manage a trade." },
  { "text": "Patience makes money; impatience makes mistakes." },
  { "text": "Your mindset is your biggest asset." },
  { "text": "Risk is not knowing what you’re doing." },
  { "text": "Chasing trades is a shortcut to regret." },
  { "text": "The best trades are often the ones you don’t take." },
  { "text": "Emotion is the enemy of execution." },
  { "text": "Your biggest drawdown is usually from breaking your own rules." },
  { "text": "Small losses are tuition; big losses are a warning." },
  { "text": "Consistency beats intensity in the long run." },
  { "text": "Charts don’t lie, but traders often do—to themselves." },
  { "text": "Plan the trade, trade the plan." },
  { "text": "Adapt or get left behind; the market doesn’t wait." },
  { "text": "A single trade won’t make you rich, but one mistake can set you back." },
  { "text": "Respect the trend until it bends." },
  { "text": "Profit is a byproduct of disciplined execution." },
  { "text": "No one rings a bell at the top or the bottom." },
  { "text": "Focus on process, not outcome." },
  { "text": "The market rewards patience, not impatience." },
  { "text": "Every loss is a lesson if you’re willing to learn." },
  { "text": "You can’t control the market, but you can control your risk." },
  { "text": "A good trader is always a good student." },
  { "text": "Missed trades are better than forced trades." },
  { "text": "Discipline is doing what needs to be done even when you don’t feel like it." },
  { "text": "The market is a mirror reflecting your strengths and weaknesses." },
  { "text": "Never average a losing position." },
  { "text": "Risk management isn’t optional; it’s essential." },
  { "text": "It’s not the market’s job to pay your bills." },
  { "text": "Every trade has an outcome, but not every outcome defines your trading." },
  { "text": "Hope is not a strategy." },
  { "text": "Don’t let a green day feed your ego." },
  { "text": "Success in trading is a marathon, not a sprint." },
  { "text": "You are only as good as your last risk-managed trade." },
  { "text": "Trade the facts, not your feelings." },
  { "text": "Protect your capital; you can’t trade without it." },
  { "text": "Being wrong is acceptable; staying wrong is not." },
  { "text": "Let the market come to you." },
  { "text": "Losses are the rent you pay to stay in the game." },
  { "text": "Don’t trade for excitement, trade for results." },
  { "text": "The goal is consistency, not perfection." },
  { "text": "Setups are everywhere; discipline is rare." },
  { "text": "Never revenge trade—anger blinds reason." },
  { "text": "Your next best trade starts with your last honest review." },
  { "text": "Trading is simple, but not easy." },
  { "text": "Take profits when your plan tells you, not your greed." },
  { "text": "Hesitation is the cousin of regret in trading." },
  { "text": "Trust your system, not your gut—unless your gut is disciplined." },
  { "text": "Markets move in cycles; so should your expectations." },
  { "text": "Being out of the market is a position too." },
  { "text": "Don’t confuse brains with a bull market." },
  { "text": "When in doubt, stay out." },
  { "text": "Focus on execution, not on outcome." },
  { "text": "Simplicity in strategy, discipline in execution." },
  { "text": "The best traders know when to do nothing." },
  { "text": "You won’t get rich chasing alerts." },
  { "text": "Stop hoping for a different market. Trade the one in front of you." },
  { "text": "Gains are built in silence, not in noise." },
  { "text": "Your edge is useless without discipline." },
  { "text": "In trading, survival comes before profit." },
  { "text": "A clear mind sees clear trades." },
  { "text": "No one trade will make or break your career." },
  { "text": "Luck is not a strategy—don’t count on it." },
  { "text": "Take the loss; save your sanity." },
  { "text": "Ego is the silent killer of accounts." },
  { "text": "Traders who never lose sleep win more in the long run." },
  { "text": "Your process is your paycheck." },
  { "text": "The more you need money, the worse you’ll trade." },
  { "text": "There is no ‘sure thing’ in the market." },
  { "text": "One good trade is better than ten forced ones." },
  { "text": "Admit your mistakes fast; repair them faster." },
  { "text": "Staring at the screen won’t make your trade work." },
  { "text": "Protecting your downside lets your upside take care of itself." },
  { "text": "Growth happens outside your comfort zone—even in trading." },
  { "text": "Don’t compare your journey to someone else’s highlight reel." },
  { "text": "Your rules are your rescue plan." },
  { "text": "Keep your emotions out and your process in." },
  { "text": "The market always offers another chance, but not always another account." },
  { "text": "Winning feels good, but surviving feels better." },
  { "text": "Most traders quit right before they level up." },
  { "text": "Trade what you see, not what you think." },
  { "text": "Courage in trading is sticking to your plan, not taking wild bets." },
  { "text": "A calm mind is your sharpest tool." },
  { "text": "More trades do not mean more profit." },
  { "text": "Every edge loses its edge if overused." },
  { "text": "Real traders review losses, not just wins." },
  { "text": "Sticking to your stops saves you from bigger drops." },
  { "text": "Protect your mental capital as fiercely as your money." },
  { "text": "The secret to long-term gains is short-term survival." },
  { "text": "You can’t win them all, but you can lose less." },
  { "text": "Be a student of the market, not a victim." },
  { "text": "Trade less, profit more." },
  { "text": "The best traders know when to step away." },
  { "text": "Be humble, or the market will humble you." },
  { "text": "Judge your trading by your process, not your P&L." },
  { "text": "Adapt, adjust, and keep moving forward." }
]
